
// 계좌 생성

// 해당되는 아이디의 계좌가 없으면
// 유저매니저 계좌 배열 한개 생성
// 새로 만든 배열에 생성자
// 랜덤으로 만든 계좌번호 넣기

// 계좌가 이미 있으면
// temp 배열에 현재아이디 해당하는 계좌를 넣음 ( 복사 )
// tempAccCount객체에 계좌 갯수 넣음 ( 복사 )
// 계좌 배열 추가 + 1
// for문으로 데이터 집어넣기
// 계좌번호 배열에 기존 계좌 넣기
// 생성자 생성
// 새로운 계좌 넣기

// 계좌 갯수 추가
// 계좌생성 메세지 출력



// 계좌삭제

// 해당되는 아이디의 계좌가 없으면
// 삭제 불가 메세지 출력
// 다음 코드 무시하고 다시 처음으로

// 해당되는 아이디의 계좌가 한개면
// 배열 초기화

// 해당되는 아이디의 계좌가 여러개면
// deleteAccount : 삭제하고싶은 계좌번호
// 계좌 갯수를 temp에 복사
// 삭제 인덱스
// 있는 계좌중에 삭제하고싶은 계좌가 일치한지 확인
// 일치하면
// 해당되는 인덱스 넣기

// 잘못된 계좌번호를 입력하면
// 잘못된 계좌임을 출력
// 다음 코드 무시하고 다시 처음으로

// 존재하는 계좌번호와 삭제할 계좌번호가 같으면
// temp 에 복사
// 배열 인덱스 줄이기
// temp 에 넣어둔 계좌를
// 삭제한 계좌를 제외하고
// 데이터 넣기

// 해당되는 유저 계좌 카운트 감소


// 조회하기
// 생성된 계좌가 없으면
// 계좌가 없는 메세지 출력
// 생성된 계좌가 있으면
// 존재하는 계좌 출력




